{"id":132,"ndex":132,"species":"Ditto","form":"Ditto","types":["Normal"],"abilities":["Limber"],"hidden_ability":"Imposter","hp":48,"attack":48,"defense":48,"special_attack":48,"special_defense":48,"speed":48,"total":288,"weight":"8.8 lbs.","height":"1'00\"","class":"Transform Pokémon","percent_male":null,"percent_female":null,"egg_groups":["Ditto"],"moves":{"start":["Transform"],"egg":[],"tm":[],"level":[],"tutor":[],"oras":[]},"descriptions":[{"version":"Red/Blue","description":"Capable of copying an enemy's genetic code to instantly transform itself into a duplicate of the enemy."},{"version":"Yellow","description":"When it spots an enemy, its body transfigures into an almost perfect copy of its opponent."},{"version":"Gold","description":"It can transform into anything. When it sleeps, it changes into a stone to avoid being attacked."},{"version":"Silver","description":"Its transformation ability is perfect. However, if made to laugh, it can't maintain its disguise."},{"version":"Crystal","description":"When it encounters another DITTO, it will move faster than normal to duplicate that opponent exactly."},{"version":"Ruby/Sapphire","description":"DITTO rearranges its cell structure to transform itself into other shapes. However, if it tries to transform itself into something by relying on its memory, this POKéMON manages to get details wrong."},{"version":"FireRed","description":"It can freely recombine its own cellular structure to transform into other life-forms."},{"version":"LeafGreen","description":"Capable of copying an opponent’s genetic code to instantly transform itself into a duplicate of the enemy."},{"version":"Emerald","description":"A DITTO rearranges its cell structure to transform itself. However, if it tries to change based on its memory, it will get details wrong."},{"version":"Diamond/Pearl/Platinum","description":"It has the ability to reconstitute its entire cellular structure to transform into whatever it sees."},{"version":"HeartGold","description":"It can transform into anything. When it sleeps, it changes into a stone to avoid being attacked."},{"version":"SoulSilver","description":"Its transformation ability is perfect. However, if made to laugh, it can’t maintain its disguise."},{"version":"Black/White","description":"It has the ability to reconstitute its entire cellular structure to transform into whatever it sees."},{"version":"Black 2/White 2","description":"It can reconstitute its entire cellular structure to change into what it sees, but it returns to normal when it relaxes."},{"version":"X","description":"It has the ability to reconstitute its entire cellular structure to transform into whatever it sees."},{"version":"Y","description":"It can freely recombine its own cellular structure to transform into other life-forms."},{"version":"Omega Ruby/Alpha Sapphire","description":"Ditto rearranges its cell structure to transform itself into other shapes. However, if it tries to transform itself into something by relying on its memory, this Pokémon manages to get details wrong."},{"version":"Sun","description":"It can reorganize its cells to make itself into a duplicate of anything it sees. The quality of the duplicate depends on the individual."},{"version":"Moon","description":"With its astonishing capacity for metamorphosis, it can get along with anything. It does not get along well with its fellow Ditto."}]}