{"id":265,"ndex":265,"species":"Wurmple","form":"Wurmple","types":["Bug"],"abilities":["Shield Dust"],"hidden_ability":"Run Away","hp":45,"attack":45,"defense":35,"special_attack":20,"special_defense":30,"speed":20,"total":195,"weight":"7.9 lbs.","height":"1'00\"","class":"Worm Pokémon","percent_male":0.5,"percent_female":0.5,"egg_groups":["Bug"],"moves":{"start":["Tackle","String Shot"],"egg":[],"tm":[],"level":[{"level":"5","move":"Poison Sting"},{"level":"15","move":"Bug Bite"}],"tutor":[],"oras":["Bug Bite","Electroweb","Snore"]},"descriptions":[{"version":"Ruby","description":"Using the spikes on its rear end,   WURMPLE peels the bark off trees and feeds on the sap that oozes out. This POKéMON’s feet are tipped with suction pads that allow it to cling to glass without slipping."},{"version":"Sapphire","description":"WURMPLE is targeted by SWELLOW as prey. This POKéMON will try to resist by pointing the spikes on its rear at the attacking predator. It will weaken the foe by leaking poison from the spikes."},{"version":"FireRed/LeafGreen","description":"It lives amidst tall grass and in forests. When attacked, it resists by pointing its venomous spikes at the foe."},{"version":"Emerald","description":"It sticks to tree branches and eats leaves. The thread it spits from its mouth, which becomes gooey when it touches air, slows the movement of its foes."},{"version":"Diamond","description":"It loves to eat leaves. If it is attacked by a STARLY, it will defend itself with its spiked rear."},{"version":"Pearl","description":"It spits a white silk that turns sticky when it contacts air. It is used to immobilize foes."},{"version":"Platinum","description":"Often targeted by bird Pokémon, it desperately resists by releasing poison from its tail spikes."},{"version":"HeartGold/SoulSilver","description":"It lives among the tall grass and in forests. It repels attacks by  raising up the spikes on its rear."},{"version":"Black/White/Black 2/White 2","description":"Often targeted by bird Pokémon, it desperately resists by releasing poison from its tail spikes."},{"version":"X","description":"It loves to eat leaves. If it is attacked by a Starly, it will defend itself with its spiked rear."},{"version":"Y","description":"It lives among the tall grass and in forests. It repels attacks by raising up the spikes on its rear."},{"version":"Omega Ruby","description":"Using the spikes on its rear end, Wurmple peels the bark off trees and feeds on the sap that oozes out. This Pokémon’s feet are tipped with suction pads that allow it to cling to glass without slipping."},{"version":"Alpha Sapphire","description":"Wurmple is targeted by Swellow as prey. This Pokémon will try to resist by pointing the spikes on its rear at the attacking predator. It will weaken the foe by leaking poison from the spikes."}],"family":[{"id":265,"name":"Wurmple"},{"id":266,"name":"Silcoon"},{"id":267,"name":"Beautifly"},{"id":268,"name":"Cascoon"},{"id":269,"name":"Dustox"}]}